Astbel/DSPIC_PFC/PWM.X/mcc_generated_files/pwm.h
/**
  PWM Generated Driver API Header File

  @Company
    Microchip Technology Inc.

  @File Name
    pwm.h

  @Summary
    This is the generated header file for the PWM driver using PIC24 / dsPIC33 / PIC32MM MCUs

  @Description
    This header file provides APIs for driver for PWM.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.171.4
        Device            :  dsPIC33CK256MP508
    The generated drivers are tested against the following:
        Compiler          :  XC16 v2.10
        MPLAB 	          :  MPLAB X v6.05
*/

/*
    (c) 2020 Microchip Technology Inc. and its subsidiaries. You may use this
    software and any derivatives exclusively with Microchip products.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
    WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
    BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
    FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
    ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
    THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
    TERMS.
*/

#ifndef PWM_H
#define PWM_H

/**
 Section: Included Files
*/

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>

#ifdef __cplusplus // Provide C++ Compatibility

extern "C"
{

#endif

/**
  Section: Data Type Definitions
*/

/** PWM Generator Definition
 @Summary
   Defines the PWM generators available for PWM

 @Description
   This routine defines the PWM generators that are available for the module to use.

 Remarks:
   None
 */
/*Pin define*/
#define BUTTON_S1_PORT PORTEbits.RE7
#define BUTTON_S1_PRESSED TRISEbits.TRISE7
#define BUTTON_S2_PORT  PORTEbits.RE8
#define BUTTON_S2_TRIS  TRISEbits.TRISE8
#define BUTTON_S3_PORT  PORTEbits.RE9
#define BUTTON_S3_TRIS  TRISEbits.TRISE9
/*BTN status*/
#define BUTTON_S1_PRESSED 0
#define BUTTON_S2_PRESSED 0
#define BUTTON_S3_PRESSED 0

/*條件編譯*/
#define Test_Duty_Modulation 1
#define Test_Freq_Modulation 1
#define Test_Phase 1
#define Test_PTPER_RESET 1
#define Latch_Test 1
/*Boolean */
#define True 1
#define False 0

/*pwm 1% resulation*/
#define PWM_1_Duty (0x190)
/*Freq 1% resulation*/
#define Freq_1_PER (0x190)
#define Freq_10KHz (0xFA0)

  /*varialbe*/

  /*method*/
  uint8_t check_BTN_Press(void);
  uint8_t check_SW2_Press(void);
  /*struct enu,*/
  typedef enum
  {
    PWM_GENERATOR_1 = 1,
    PWM_GENERATOR_2 = 2,
  } PWM_GENERATOR;

  /** PWM Generator Interrupt Definition

   @Summary
     Defines the PWM generator interrupt available for PWM

   @Description
     This routine defines the PWM generator interrupt that are available for the module to use.

   Remarks:
     None
   */
  typedef enum
  {
    PWM_GENERATOR_INTERRUPT_FAULT = 1,
    PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT = 2,
    PWM_GENERATOR_INTERRUPT_FEED_FORWARD = 3,
    PWM_GENERATOR_INTERRUPT_SYNC = 4,
  } PWM_GENERATOR_INTERRUPT;

  /**
   Section: Interface Routines
  */

  /**
    @Summary
      Initializes PWM module.

    @Description
      This routine initializes PWM module, using the given initialization data.

    @Param
      None.

    @Returns
      None

    @Example
      <code>
      uint16_t masterPeriod,masterDutyCycle,masterPhase;

      masterPeriod = 0xFFFF;
      masterDutyCycle = 0xFF;
      masterPhase = 0xF;

      PWM_Initialize();

      PWM_GeneratorDisable();

      PWM_MasterPeriodSet(masterPeriod);
      PWM_MasterDutyCycleSet(masterDutyCycle);
      PWM_MasterPhaseSet(masterPhase);

      PWM_GeneratorEnable(PWM_GENERATOR_1);

      </code>
  */
  void PWM_Initialize(void);

  /**
    @Summary
      Enables the specific PWM generator.

    @Description
      This routine is used to enable the specific PWM generator selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_GeneratorEnable(PWM_GENERATOR_1);
      </code>
  */
  inline static void PWM_GeneratorEnable(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1CONLbits.ON = 1;
      break;
    case PWM_GENERATOR_2:
      PG2CONLbits.ON = 1;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Disables the specific PWM generator.

    @Description
      This routine is used to disable the specific PWM generator selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_GeneratorDisable(PWM_GENERATOR_1);
      </code>
  */
  inline static void PWM_GeneratorDisable(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1CONLbits.ON = 0;
      break;
    case PWM_GENERATOR_2:
      PG2CONLbits.ON = 0;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Enables all the generators of PWM module.

    @Description
      This routine is used to enable all the generators of PWM module.

    @Param
      None.

    @Returns
      None

    @Example
      <code>
      PWM_Enable();
      </code>
  */
  inline static void PWM_Enable()
  {
    PG1CONLbits.ON = 1;
    PG2CONLbits.ON = 1;
  }

  /**
    @Summary
      Disables all the generators of PWM module.

    @Description
      This routine is used to disable all the generators of PWM module.

    @Param
      None.

    @Returns
      None

    @Example
      <code>
      PWM_Disable();
      </code>
  */
  inline static void PWM_Disable()
  {
    PG1CONLbits.ON = 0;
    PG2CONLbits.ON = 0;
  }

  /**
    @Summary
      Sets the period value in count for the Master Time Base generator.

    @Description
      This routine is used to set the period value in count for the Master Time Base generator.

    @Param
      masterPeriod - Period value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t masterPeriod;

      masterPeriod = 0xFF;

      PWM_MasterPeriodSet(masterPeriod);
      </code>
  */
  inline static void PWM_MasterPeriodSet(uint16_t masterPeriod)
  {
    MPER = masterPeriod;
  }

  /**
    @Summary
      Used to set the PWM master duty cycle register.

    @Description
      This routine is used to set the PWM master duty cycle register.

    @Param
      masterDutyCycle - Master Duty Cycle value.

    @Returns
      None

    @Example
      <code>
      uint16_t masterDutyCycle;

      masterDutyCycle = 0xFF;

