Astbel/DSPIC_PFC/PWM.X/mcc_generated_files/pwm.h
      PWM_MasterDutyCycleSet(masterDutyCycle);
      </code>
  */
  inline static void PWM_MasterDutyCycleSet(uint16_t masterDutyCycle)
  {
    MDC = masterDutyCycle;
  }

  /**
    @Summary
      Sets the phase value in count for the Master Time Base generator.

    @Description
      This routine is used to set the phase value in count for the Master Time Base generator.

    @Param
      masterPhase - Phase value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t masterPhase;

      masterPhase = 0xFF;

      PWM_MasterPhaseSet(masterPhase);
      </code>
  */
  inline static void PWM_MasterPhaseSet(uint16_t masterPhase)
  {
    MPHASE = masterPhase;
  }

  /**
    @Summary
      Sets the period value in count for the PWM generator specific Time Base.

    @Description
      This routine is used to set the period value in count for the PWM generator specific Time Base.

    @Param
      genNum - PWM generator number.
      period - PWM generator period value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t period;

      period = 0xFFFF;
      PWM_PeriodSet(PWM_GENERATOR_1, period);
      </code>
  */
  inline static void PWM_PeriodSet(PWM_GENERATOR genNum, uint16_t period)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1PER = period;
      break;
    case PWM_GENERATOR_2:
      PG2PER = period;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Used to set the PWM generator specific duty cycle register.

    @Description
      This routine is used to set the PWM generator specific duty cycle register.

    @Param
      genNum      - PWM generator number.
      dutyCycle   - PWM generator duty cycle.

    @Returns
      None

    @Example
      <code>
      uint16_t dutyCyle;

      dutyCycle = 0xFF;
      PWM_DutyCycleSet(PWM_GENERATOR_1, dutyCycle);
      </code>
  */
  inline static void PWM_DutyCycleSet(PWM_GENERATOR genNum, uint16_t dutyCycle)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1DC = dutyCycle;
      break;
    case PWM_GENERATOR_2:
      PG2DC = dutyCycle;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Sets the phase value in count for the PWM generator specific Time Base.

    @Description
      This routine is used to set the phase value in count for the PWM generator specific Time Base.

    @Param
      genNum - PWM generator number.
      phase - PWM generator phase value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t phase;

      phase = 0xFFFF;
      PWM_PhaseSet(PWM_GENERATOR_1, phase);
      </code>
  */
  inline static void PWM_PhaseSet(PWM_GENERATOR genNum, uint16_t phase)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1PHASE = phase;
      break;
    case PWM_GENERATOR_2:
      PG2PHASE = phase;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Updates PWM override data bits with the requested value for a specific PWM generator.

    @Description
      This routine is used to updates PWM override data bits with the requested
      value for a specific PWM generator selected by the argument PWM_GENERATOR.

    @Param
      genNum          - PWM generator number.
      overrideData    - Override data

    @Returns
      None

    @Example
      <code>
      uint16_t overrideData;

      overrideData = 0x01;

      PWM_OverrideDataSet(PWM_GENERATOR_1, overrideData);
      </code>
  */
  inline static void PWM_OverrideDataSet(PWM_GENERATOR genNum, uint16_t overrideData)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1IOCONLbits.OVRDAT = overrideData;
      break;
    case PWM_GENERATOR_2:
      PG2IOCONLbits.OVRDAT = overrideData;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Updates PWM override high data bit with the requested value for a specific PWM generator.

    @Description
      This routine is used to update PWM override high data bit with the requested
      value for a specific PWM generator selected by the argument PWM_GENERATOR.

    @Param
      genNum              - PWM generator number.
      overrideDataHigh    - Override data

    @Returns
      None

    @Example
      <code>
      bool overrideDataHigh;

      overrideDataHigh = true;

      PWM_OverrideDataHighSet(PWM_GENERATOR_1, overrideDataHigh);
      </code>
  */
  inline static void PWM_OverrideDataHighSet(PWM_GENERATOR genNum, bool overrideDataHigh)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1IOCONLbits.OVRDAT |= (overrideDataHigh << 1);
      break;
    case PWM_GENERATOR_2:
      PG2IOCONLbits.OVRDAT |= (overrideDataHigh << 1);
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Updates PWM override low data bit with the requested value for a specific PWM generator.

    @Description
      This routine is used to update PWM override low data bit with the requested
      value for a specific PWM generator selected by the argument PWM_GENERATOR.

    @Param
      genNum             - PWM generator number.
      overrideDataLow    - Override data

    @Returns
      None

    @Example
      <code>
      bool overrideDataLow;

      overrideDataLow = true;

      PWM_OverrideDataLowSet(PWM_GENERATOR_1, overrideDataLow);
      </code>
  */
  inline static void PWM_OverrideDataLowSet(PWM_GENERATOR genNum, bool overrideDataLow)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1IOCONLbits.OVRDAT |= overrideDataLow;
      break;
    case PWM_GENERATOR_2:
      PG2IOCONLbits.OVRDAT |= overrideDataLow;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Gets PWM override value for the PWM Generator.

    @Description
      This routine is used to get PWM override value for the PWM Generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum          - PWM generator number.

    @Returns
      Override data for the PWM Generator selected by the argument PWM_GENERATOR.

    @Example
      <code>
      PWM_GENERATOR genNum;
      uint16_t overrideData;

      genNum = PWM_GENERATOR_1;
      overrideData = PWM_OverrideDataGet(genNum, overrideData);
      </code>
  */
  inline static uint16_t PWM_OverrideDataGet(PWM_GENERATOR genNum)
  {
    uint16_t overrideData;
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      overrideData = PG1IOCONLbits.OVRDAT;
      break;
    case PWM_GENERATOR_2:
      overrideData = PG2IOCONLbits.OVRDAT;
      break;
    default:
      break;
    }
    return overrideData;
  }

  /**
    @Summary
      Enables PWM override on PWMH output for specific PWM generator.

    @Description
      This routine is used to enables PWM override on PWMH output for specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_OverrideHighEnable(PWM_GENERATOR_1);
      </code>
  */
  inline static void PWM_OverrideHighEnable(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1IOCONLbits.OVRENH = 1;
      break;
    case PWM_GENERATOR_2:
      PG2IOCONLbits.OVRENH = 1;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Enables PWM override on PWML output for specific PWM generator.

    @Description
      This routine is used to enables PWM override on PWML output for specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_OverrideLowEnable(PWM_GENERATOR_1);
      </code>
  */
  inline static void PWM_OverrideLowEnable(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1IOCONLbits.OVRENL = 1;
      break;
    case PWM_GENERATOR_2:
      PG2IOCONLbits.OVRENL = 1;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Disables PWM override on PWMH output for specific PWM generator.

    @Description
      This routine is used to disable PWM override on PWMH output for specific PWM generator
      selected by the argument PWM_GENERATOR.


    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_OverrideHighDisable(PWM_GENERATOR_1);
      </code>
  */
  inline static void PWM_OverrideHighDisable(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1IOCONLbits.OVRENH = 0;
      break;
    case PWM_GENERATOR_2:
      PG2IOCONLbits.OVRENH = 0;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Disables PWM override on PWML output for specific PWM generator.

    @Description
      This routine is used to disable PWM override on PWML output for specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_OverrideLowDisable(PWM_GENERATOR_1);
      </code>
  */
  inline static void PWM_OverrideLowDisable(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1IOCONLbits.OVRENL = 0;
      break;
    case PWM_GENERATOR_2:
      PG2IOCONLbits.OVRENL = 0;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Updates PWM Deadtime low register with the requested value for a specific PWM generator.

    @Description
      This routine is used to updates PWM Deadtime low register with the requested
      value for a specific PWM generator selected by the argument PWM_GENERATOR.

    @Param
      genNum      - PWM generator number.
      deadtimeLow - Deadtime low value.

    @Returns
      None

    @Example
      <code>
      uint16_t deadtimeLow;

      deadtimeLow = 0x01;

      PWM_DeadTimeLowSet(PWM_GENERATOR_1, deadtimeLow);
      </code>
  */
  inline static void PWM_DeadTimeLowSet(PWM_GENERATOR genNum, uint16_t deadtimeLow)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1DTL = deadtimeLow;
      break;
    case PWM_GENERATOR_2:
      PG2DTL = deadtimeLow;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Updates PWM Deadtime high register with the requested value for a specific PWM generator.

    @Description
      This routine is used to updates PWM Deadtime high register with the requested
      value for a specific PWM generator selected by the argument PWM_GENERATOR.

    @Param
      genNum          - PWM generator number.
      deadtimeHigh    - Deadtime high value.

    @Returns
      None

    @Example
      <code>
      uint16_t deadtimeHigh;

      deadtimeHigh = 0x01;

      PWM_DeadTimeHighSet(PWM_GENERATOR_1, deadtimeHigh);
      </code>
  */
  inline static void PWM_DeadTimeHighSet(PWM_GENERATOR genNum, uint16_t deadtimeHigh)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1DTH = deadtimeHigh;
      break;
    case PWM_GENERATOR_2:
      PG2DTH = deadtimeHigh;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Updates PWM Deadtime low and high register with the requested value for a specific PWM generator.

    @Description
      This routine is used to updates PWM Deadtime low and high register with the
      requested value for a specific PWM generator selected by the argument PWM_GENERATOR.

    @Param
      genNum          - PWM generator number.
      deadtimeHigh    - Deadtime value.

    @Returns
      None

    @Example
      <code>
      uint16_t deadtime;

      deadtime = 0x01;

      PWM_DeadTimeHighSet(PWM_GENERATOR_1, deadtime);
      </code>
  */
  inline static void PWM_DeadTimeSet(PWM_GENERATOR genNum, uint16_t deadtime)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1DTL = deadtime;
      PG1DTH = deadtime;
      break;
    case PWM_GENERATOR_2:
      PG2DTL = deadtime;
      PG2DTH = deadtime;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Sets the PWM trigger compare value in count for the
      PWM Generator.

    @Description
      This routine is used to set the PWM trigger compare value in count
      for the PWM Generator selected by the argument PWM_GENERATOR.

    @Param
      genNum          - PWM generator number.
      trigCompValue   - Trigger compare value in count.

    @Returns
      None

    @Example
      <code>
      PWM_GENERATOR genNum;
      uint16_t trigCompValue;

      trigCompValue = 0x01;

      genNum = PWM_GENERATOR_1;
      PWM_TriggerCompareValueSet(genNum, trigCompValue);
      </code>
  */
  inline static void PWM_TriggerCompareValueSet(PWM_GENERATOR genNum, uint16_t trigCompValue)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1TRIGA = trigCompValue;
      break;
    case PWM_GENERATOR_2:
      PG2TRIGA = trigCompValue;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Enables interrupt requests for the PWM Generator.

    @Description
      This routine is used to enable interrupt requests for the PWM Generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      interrupt - PWM generator interrupt source.

    @Returns
      None

    @Example
      <code>
      PWM_GENERATOR genNum;
      PWM_GENERATOR_INTERRUPT interrupt;

      genNum = PWM_GENERATOR_1;
      interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
      PWM_GeneratorInterruptEnable(genNum, interrupt);
      </code>
  */
  inline static void PWM_GeneratorInterruptEnable(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      switch (interrupt)
      {
      case PWM_GENERATOR_INTERRUPT_FAULT:
        PG1EVTHbits.FLTIEN = true;
        break;
      case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
        PG1EVTHbits.CLIEN = true;
        break;
      case PWM_GENERATOR_INTERRUPT_FEED_FORWARD:
        PG1EVTHbits.FFIEN = true;
        break;
      case PWM_GENERATOR_INTERRUPT_SYNC:
        PG1EVTHbits.SIEN = true;
        break;
      default:
        break;
      }
      break;
    case PWM_GENERATOR_2:
      switch (interrupt)
      {
      case PWM_GENERATOR_INTERRUPT_FAULT:
        PG2EVTHbits.FLTIEN = true;
        break;
      case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
        PG2EVTHbits.CLIEN = true;
        break;
      case PWM_GENERATOR_INTERRUPT_FEED_FORWARD:
        PG2EVTHbits.FFIEN = true;
        break;
      case PWM_GENERATOR_INTERRUPT_SYNC:
        PG2EVTHbits.SIEN = true;
        break;
      default:
        break;
      }
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Disables interrupt requests for the PWM Generator.

    @Description
      This routine is used to disables interrupt requests for the PWM
      Generator selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      interrupt - PWM generator interrupt source.

    @Returns
      None

    @Example
      <code>
      PWM_GENERATOR genNum;
      PWM_GENERATOR_INTERRUPT interrupt;

      genNum = PWM_GENERATOR_1;
      interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
      PWM_GeneratorInterruptDisable(genNum, interrupt);
      </code>
  */
  inline static void PWM_GeneratorInterruptDisable(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      switch (interrupt)
      {
      case PWM_GENERATOR_INTERRUPT_FAULT:
        PG1EVTHbits.FLTIEN = false;
        break;
      case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
        PG1EVTHbits.CLIEN = false;
        break;
      case PWM_GENERATOR_INTERRUPT_FEED_FORWARD:
        PG1EVTHbits.FFIEN = false;
        break;
      case PWM_GENERATOR_INTERRUPT_SYNC:
        PG1EVTHbits.SIEN = false;
        break;
      default:
        break;
      }
      break;
    case PWM_GENERATOR_2:
      switch (interrupt)
      {
      case PWM_GENERATOR_INTERRUPT_FAULT:
        PG2EVTHbits.FLTIEN = false;
        break;
      case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
        PG2EVTHbits.CLIEN = false;
        break;
      case PWM_GENERATOR_INTERRUPT_FEED_FORWARD:
        PG2EVTHbits.FFIEN = false;
        break;
      case PWM_GENERATOR_INTERRUPT_SYNC:
        PG2EVTHbits.SIEN = false;
        break;
      default:
        break;
      }
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Clears PWM interrupt status for the PWM Generator.

    @Description
      This routine is used to clear PWM interrupt status for the PWM Generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      interrupt - PWM generator interrupt source.

    @Returns
      None

    @Example
      <code>
      PWM_GENERATOR genNum;
      PWM_GENERATOR_INTERRUPT interrupt;

      genNum = PWM_GENERATOR_1;
      interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
      PWM_GeneratorEventStatusClear(genNum, interrupt);
      </code>
  */
  inline static void PWM_GeneratorEventStatusClear(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      switch (interrupt)
      {
      case PWM_GENERATOR_INTERRUPT_FAULT:
        PG1STATbits.FLTEVT = 0;
        break;
      case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
        PG1STATbits.CLEVT = 0;
        break;
      case PWM_GENERATOR_INTERRUPT_FEED_FORWARD:
        PG1STATbits.FFEVT = 0;
        break;
      case PWM_GENERATOR_INTERRUPT_SYNC:
        PG1STATbits.SEVT = 0;
        break;
      default:
        break;
      }
      break;
    case PWM_GENERATOR_2:
      switch (interrupt)
      {
      case PWM_GENERATOR_INTERRUPT_FAULT:
        PG2STATbits.FLTEVT = 0;
        break;
      case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
        PG2STATbits.CLEVT = 0;
        break;
      case PWM_GENERATOR_INTERRUPT_FEED_FORWARD:
        PG2STATbits.FFEVT = 0;
        break;
      case PWM_GENERATOR_INTERRUPT_SYNC:
        PG2STATbits.SEVT = 0;
        break;
      default:
        break;
      }
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Gets PWM interrupt status for the PWM Generator.

    @Description
      This routine is used to get PWM interrupt status for the PWM Generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      interrupt - PWM generator interrupt source.

    @Returns
      true - Interrupt is pending.
      false - Interrupt is not pending.

    @Example
      <code>
      PWM_GENERATOR genNum;
      PWM_GENERATOR_INTERRUPT interrupt;
      bool status;

      genNum = PWM_GENERATOR_1;
      interrupt = PWM_GENERATOR_INTERRUPT_TRIGGER;
      status = PWM_GeneratorEventStatusGet(genNum, interrupt);
      </code>
  */
  inline static bool PWM_GeneratorEventStatusGet(PWM_GENERATOR genNum, PWM_GENERATOR_INTERRUPT interrupt)
  {
    bool status = false;
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      switch (interrupt)
      {
      case PWM_GENERATOR_INTERRUPT_FAULT:
        status = PG1STATbits.FLTEVT;
        break;
      case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
        status = PG1STATbits.CLEVT;
        break;
      case PWM_GENERATOR_INTERRUPT_FEED_FORWARD:
        status = PG1STATbits.FFEVT;
        break;
      case PWM_GENERATOR_INTERRUPT_SYNC:
        status = PG1STATbits.SEVT;
        break;
      default:
        break;
      }
      break;
    case PWM_GENERATOR_2:
      switch (interrupt)
      {
      case PWM_GENERATOR_INTERRUPT_FAULT:
        status = PG2STATbits.FLTEVT;
        break;
      case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
        status = PG2STATbits.CLEVT;
        break;
      case PWM_GENERATOR_INTERRUPT_FEED_FORWARD:
        status = PG2STATbits.FFEVT;
        break;
      case PWM_GENERATOR_INTERRUPT_SYNC:
        status = PG2STATbits.SEVT;
        break;
      default:
        break;
      }
      break;
    default:
      break;
    }
    return status;
  }

  /**
    @Summary
      Sets the TRIGA compare value in count for a specific PWM generator.

    @Description
      This routine is used to set the TRIGA compare value in count for a specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      trigA  - TRIGA compare value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t trigA;

      trigA = 0xF;
      PWM_TriggerACompareValueSet(PWM_GENERATOR_1, trigA);
      </code>
  */
  inline static void PWM_TriggerACompareValueSet(PWM_GENERATOR genNum, uint16_t trigA)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1TRIGA = trigA;
      break;
    case PWM_GENERATOR_2:
      PG2TRIGA = trigA;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Sets the TRIGB compare value in count for a specific PWM generator.

    @Description
      This routine is used to set the TRIGB compare value in count for a specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      trigB  - TRIGB compare value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t trigB;

