Astbel/DSPIC_PFC/PWM.X/mcc_generated_files/pwm.h
      trigB = 0xF;
      PWM_TriggerBCompareValueSet(PWM_GENERATOR_1, trigB);
      </code>
  */
  inline static void PWM_TriggerBCompareValueSet(PWM_GENERATOR genNum, uint16_t trigB)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1TRIGB = trigB;
      break;
    case PWM_GENERATOR_2:
      PG2TRIGB = trigB;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Sets the TRIGC compare value in count for a specific PWM generator.

    @Description
      This routine is used to set the TRIGC compare value in count for a specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      trigC  - TRIGC compare value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t trigC;

      trigC = 0xF;
      PWM_TriggerCCompareValueSet(PWM_GENERATOR_1, trigC);
      </code>
  */
  inline static void PWM_TriggerCCompareValueSet(PWM_GENERATOR genNum, uint16_t trigC)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1TRIGC = trigC;
      break;
    case PWM_GENERATOR_2:
      PG2TRIGC = trigC;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Requests to update the data registers for specific PWM generator.

    @Description
      This routine is used to request to update the data registers for specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_SoftwareUpdateRequest(PWM_GENERATOR_1);
      </code>
  */
  inline static void PWM_SoftwareUpdateRequest(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1STATbits.UPDREQ = 1;
      break;
    case PWM_GENERATOR_2:
      PG2STATbits.UPDREQ = 1;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Gets the status of the update request for specific PWM generator.

    @Description
      This routine is used to get the status of the update request for specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      bool status;

      status = PWM_SoftwareUpdatePending(PWM_GENERATOR_1);
      </code>
  */
  inline static bool PWM_SoftwareUpdatePending(PWM_GENERATOR genNum)
  {
    bool status = false;
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      status = PG1STATbits.UPDATE;
      break;
    case PWM_GENERATOR_2:
      status = PG2STATbits.UPDATE;
      break;
    default:
      break;
    }
    return status;
  }

  /**
    @Summary
      Clears the status of PWM latched fault mode for the PWM Generator.

    @Description
      This routine is used to clear the status of PWM latched fault mode
      for the PWM Generator selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_GENERATOR genNum;

      genNum = PWM_GENERATOR_1;
      PWM_FaultModeLatchClear(genNum);
      </code>
  */
  inline static void PWM_FaultModeLatchClear(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1FPCILbits.SWTERM = 1;
      break;
    case PWM_GENERATOR_2:
      PG2FPCILbits.SWTERM = 1;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Callback for PWM1 interrupt.

    @Description
      This routine is callback for PWM1 interrupt

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_Generator1_CallBack();
      </code>
  */
  void PWM_Generator1_CallBack(void);

  /**
    @Summary
      Assigns a function pointer with a PWM Generator1 callback address.

    @Description
      This routine assigns a function pointer with a PWM Generator1
      callback address.

    @Param
      Address of the callback routine.

    @Returns
      None

    @Example
      <code>
      PWM_SetGenerator1InterruptHandler(&PWM_Generator1_CallBack);
      </code>
  */
  void PWM_SetGenerator1InterruptHandler(void *handler);

  /**
    @Summary
      Callback for PWM2 interrupt.

    @Description
      This routine is callback for PWM2 interrupt

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_Generator2_CallBack();
      </code>
  */
  void PWM_Generator2_CallBack(void);

  /**
    @Summary
      Tasks routine for PWM2.

    @Description
      This is a tasks routine for PWM2.

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_Generator2_Tasks();
      </code>
  */
  void PWM_Generator2_Tasks(void);

  /**
    @Summary
      Callback for EventA interrupt.

    @Description
      This routine is callback for EventA interrupt

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventA_CallBack();
      </code>
  */
  void PWM_EventA_CallBack(void);

  /**
    @Summary
      Assigns a function pointer with a PWM EventA callback address.

    @Description
      This routine assigns a function pointer with a PWM EventA
      callback address.

    @Param
      Address of the callback routine.

    @Returns
      None

    @Example
      <code>
      PWM_SetEventAInterruptHandler(&PWM_EventA_CallBack);
      </code>
  */
  void PWM_SetEventAInterruptHandler(void *handler);

  /**
    @Summary
      Callback for EventB interrupt.

    @Description
      This routine is callback for EventB interrupt

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventB_CallBack();
      </code>
  */
  void PWM_EventB_CallBack(void);

  /**
    @Summary
      Assigns a function pointer with a PWM EventB callback address.

    @Description
      This routine assigns a function pointer with a PWM EventB
      callback address.

    @Param
      Address of the callback routine.

    @Returns
      None

    @Example
      <code>
      PWM_SetEventBInterruptHandler(&PWM_EventB_CallBack);
      </code>
  */
  void PWM_SetEventBInterruptHandler(void *handler);

  /**
    @Summary
      Callback for EventC interrupt.

    @Description
      This routine is callback for EventC interrupt

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventC_CallBack();
      </code>
  */
  void PWM_EventC_CallBack(void);

  /**
    @Summary
      Tasks routine for EventC.

    @Description
      This is a tasks routine for EventC.

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventC_Tasks();
      </code>
  */
  void PWM_EventC_Tasks(void);

  /**
    @Summary
      Callback for EventD interrupt.

    @Description
      This routine is callback for EventD interrupt

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventD_CallBack();
      </code>
  */
  void PWM_EventD_CallBack(void);

  /**
    @Summary
      Tasks routine for EventD.

    @Description
      This is a tasks routine for EventD.

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventD_Tasks();
      </code>
  */
  void PWM_EventD_Tasks(void);

  /**
    @Summary
      Callback for EventE interrupt.

    @Description
      This routine is callback for EventE interrupt

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventE_CallBack();
      </code>
  */
  void PWM_EventE_CallBack(void);

  /**
    @Summary
      Tasks routine for EventE.

    @Description
      This is a tasks routine for EventE.

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventE_Tasks();
      </code>
  */
  void PWM_EventE_Tasks(void);

  /**
    @Summary
      Callback for EventF interrupt.

    @Description
      This routine is callback for EventF interrupt

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventF_CallBack();
      </code>
  */
  void PWM_EventF_CallBack(void);

  /**
    @Summary
      Tasks routine for EventF.

    @Description
      This is a tasks routine for EventF.

    @Param
      None.

    @Returns
      None.

    @Example
      <code>
      PWM_EventF_Tasks();
      </code>
  */
  void PWM_EventF_Tasks(void);

