Astbel/DSPIC_PFC/PWM.X/mcc_generated_files/pwm.h
  /*******************************************************************************

    !!! Deprecated Definitions and APIs !!!
    !!! These functions will not be supported in future releases !!!

  *******************************************************************************/
  /**
    @Summary
      Enables the specific PWM generator.

    @Description
      This routine is used to enable the specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_GENERATOR genNum;

      genNum = PWM_GENERATOR_1;
      PWM_ModuleEnable(genNum);
      </code>
  */
  inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorEnable instead."))) PWM_ModuleEnable(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1CONLbits.ON = 1;
      break;
    case PWM_GENERATOR_2:
      PG2CONLbits.ON = 1;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Disables the specific PWM generator.

    @Description
      This routine is used to disable the specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_GENERATOR genNum;

      genNum = PWM_GENERATOR_1;
      PWM_ModuleDisable(genNum);
      </code>
  */
  inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_GeneratorDisable instead."))) PWM_ModuleDisable(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1CONLbits.ON = 0;
      break;
    case PWM_GENERATOR_2:
      PG2CONLbits.ON = 0;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Enables/Disables PWM override on PWML output for specific PWM generator.

    @Description
      This routine is used to enable/disable PWM override on PWML output for specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      enableOverride  - Data to enable or disable override low.

    @Returns
      None

    @Example
      <code>
      PWM_OverrideLowEnableSet(PWM_GENERATOR_1, enableOverride);
      </code>
  */
  inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_OverrideLowEnable and PWM_OverrideLowDisable instead."))) PWM_OverrideLowEnableSet(PWM_GENERATOR genNum, bool enableOverride)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1IOCONLbits.OVRENL = enableOverride;
      break;
    case PWM_GENERATOR_2:
      PG2IOCONLbits.OVRENL = enableOverride;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Enables/Disables PWM override on PWMH output for specific PWM generator.

    @Description
      This routine is used to enable/disable PWM override on PWMH output for specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      enableOverride  - Data to enable or disable override high.

    @Returns
      None

    @Example
      <code>
      PWM_OverrideHighEnableSet(PWM_GENERATOR_1, enableOverride);
      </code>
  */
  inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_OverrideHighEnable and PWM_OverrideHighDisable instead."))) PWM_OverrideHighEnableSet(PWM_GENERATOR genNum, bool enableOverride)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1IOCONLbits.OVRENH = enableOverride;
      break;
    case PWM_GENERATOR_2:
      PG2IOCONLbits.OVRENH = enableOverride;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Sets the TRIGA compare value in count for a specific PWM generator.

    @Description
      This routine is used to set the TRIGA compare value in count for a specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      trigA  - TRIGA compare value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t trigA;

      trigA = 0xF;
      PWM_TRIGACompareSet(PWM_GENERATOR_1, trigA);
      </code>
  */
  inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_TriggerACompareValueSet instead."))) PWM_TRIGACompareSet(PWM_GENERATOR genNum, uint16_t trigA)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1TRIGA = trigA;
      break;
    case PWM_GENERATOR_2:
      PG2TRIGA = trigA;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Sets the TRIGB compare value in count for a specific PWM generator.

    @Description
      This routine is used to set the TRIGB compare value in count for a specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      trigB  - TRIGB compare value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t trigB;

      trigB = 0xF;
      PWM_TRIGBCompareSet(PWM_GENERATOR_1, trigB);
      </code>
  */
  inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_TriggerBCompareValueSet instead."))) PWM_TRIGBCompareSet(PWM_GENERATOR genNum, uint16_t trigB)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1TRIGB = trigB;
      break;
    case PWM_GENERATOR_2:
      PG2TRIGB = trigB;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Sets the TRIGC compare value in count for a specific PWM generator.

    @Description
      This routine is used to set the TRIGC compare value in count for a specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.
      trigC  - TRIGC compare value in count.

    @Returns
      None

    @Example
      <code>
      uint16_t trigC;

      trigC = 0xF;
      PWM_TRIGCCompareSet(PWM_GENERATOR_1, trigC);
      </code>
  */
  inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_TriggerCCompareValueSet instead."))) PWM_TRIGCCompareSet(PWM_GENERATOR genNum, uint16_t trigC)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1TRIGC = trigC;
      break;
    case PWM_GENERATOR_2:
      PG2TRIGC = trigC;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Requests to update the data registers for specific PWM generator.

    @Description
      This routine is used to request to update the data registers for specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      PWM_DataUpdateRequestSet(PWM_GENERATOR_1);
      </code>
  */
  inline static void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_SoftwareUpdateRequest instead."))) PWM_DataUpdateRequestSet(PWM_GENERATOR genNum)
  {
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      PG1STATbits.UPDREQ = 1;
      break;
    case PWM_GENERATOR_2:
      PG2STATbits.UPDREQ = 1;
      break;
    default:
      break;
    }
  }

  /**
    @Summary
      Gets the status of the update request for specific PWM generator.

    @Description
      This routine is used to get the status of the update request for specific PWM generator
      selected by the argument PWM_GENERATOR.

    @Param
      genNum - PWM generator number.

    @Returns
      None

    @Example
      <code>
      bool status;

      status = PWM_DataUpdateStatusGet(PWM_GENERATOR_1);
      </code>
  */
  inline static bool __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse PWM_SoftwareUpdatePending instead."))) PWM_DataUpdateStatusGet(PWM_GENERATOR genNum)
  {
    bool status = false;
    switch (genNum)
    {
    case PWM_GENERATOR_1:
      status = PG1STATbits.UPDATE;
      break;
    case PWM_GENERATOR_2:
      status = PG2STATbits.UPDATE;
      break;
    default:
      break;
    }
    return status;
  }

#ifdef __cplusplus // Provide C++ Compatibility
}

#endif

#endif // PWM_H
